app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "MATH"], ["room_number", 303], ["created_at", "2021-01-19 00:14:50.602834"], ["updated_at", "2021-01-19 00:14:50.602834"]]
---
    def create
        @school_class = SchoolClass.create(school_class_params)