app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Rachelle"], ["last_name", "spicer"], ["created_at", "2021-01-19 02:31:04.372682"], ["updated_at", "2021-01-19 02:31:04.372682"]]
---
    def create
       @student = Student.create(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Alison- edit"], ["last_name", "Spicer- edit"], ["updated_at", "2021-01-19 02:35:15.872082"], ["id", 4]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(student_params)